[
  {
    "id": 1,
    "recipe_name": "Kala Vuna",
    "recipe_img": "[Image of Kala Vuna]",
    "recipe_details": "Kala Vuna is a traditional Bengali dish that combines the earthy flavors of black gram (kala chana) with a rich, aromatic gravy. The black gram is slow-cooked until tender, allowing it to absorb the complex blend of spices including cumin, coriander, turmeric, and garam masala. Coconut milk is added towards the end to give the dish a creamy texture and a hint of sweetness that perfectly balances the spiciness. Garnished with fresh coriander and served with steamed rice, this dish is a staple for festive occasions and family gatherings in Bangladesh.",
    "youtube_video_code": "https://www.youtube.com/watch?v=fPHxBQzaAzI",
    "country": "Bangladesh",
    "category": "Lunch",
    "creatorEmail": "chef.raj@spiceup.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 2,
    "recipe_name": "Chicken Tikka Masala",
    "recipe_img": "[Image of Chicken Tikka Masala]",
    "recipe_details": "Chicken Tikka Masala is a beloved dish that features tender pieces of chicken marinated in a blend of yogurt and fragrant spices, including cumin, coriander, and garam masala. The marinated chicken is then grilled to perfection, creating a smoky flavor, before being simmered in a creamy tomato sauce. The sauce, made with tomatoes, cream, and a touch of butter, is enriched with spices such as turmeric, paprika, and cayenne pepper, giving it a vibrant color and a delightful balance of flavors. This dish is typically served with basmati rice or naan bread, making it a hearty and satisfying meal.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "India",
    "category": "Dinner",
    "creatorEmail": "home.cook.maria@foodfusion.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 3,
    "recipe_name": "Pad Thai",
    "recipe_img": "[Image of Pad Thai]",
    "recipe_details": "Pad Thai is a quintessential Thai street food that offers a perfect balance of sweet, sour, salty, and spicy flavors. This dish features stir-fried rice noodles combined with a variety of ingredients such as scrambled eggs, tofu, shrimp or chicken, and a mix of vegetables including bean sprouts and green onions. The sauce, made from tamarind paste, fish sauce, sugar, and chili powder, coats the noodles beautifully, creating a tangy and flavorful profile. Garnished with crushed peanuts, fresh lime wedges, and cilantro, Pad Thai is a complete meal that delights the taste buds with every bite.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Thailand",
    "category": "Lunch",
    "creatorEmail": "street.food.secrets@thaifood.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 4,
    "recipe_name": "Penne Arrabbiata",
    "recipe_img": "[Image of Penne Arrabbiata]",
    "recipe_details": "Penne Arrabbiata is a classic Italian pasta dish known for its spicy and robust flavors. The name 'Arrabbiata' translates to 'angry' in Italian, reflecting the dish's fiery heat. It features penne pasta tossed in a sauce made from tomatoes, garlic, and a generous amount of red chili flakes. The sauce is simmered to perfection, allowing the flavors to meld together and create a rich, spicy coating for the pasta. Topped with freshly grated Parmesan cheese and a sprinkle of chopped parsley, Penne Arrabbiata is a simple yet satisfying meal that packs a punch.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Italy",
    "category": "Dinner",
    "creatorEmail": "nonna.pia@italianrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 5,
    "recipe_name": "Sushi",
    "recipe_img": "[Image of Sushi]",
    "recipe_details": "Sushi is a traditional Japanese dish that combines vinegared rice with a variety of ingredients, including fresh seafood, vegetables, and occasionally tropical fruits. The most popular types of sushi include nigiri (hand-pressed rice topped with seafood), maki (rolled sushi), and sashimi (sliced raw fish served without rice). Each piece of sushi is meticulously crafted to highlight the natural flavors and textures of its ingredients. Often served with pickled ginger, wasabi, and soy sauce, sushi is not just a meal but an art form that emphasizes simplicity, freshness, and balance.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Japan",
    "category": "Lunch",
    "creatorEmail": "sushi.master@japanesefood.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 6,
    "recipe_name": "Pizza Margherita",
    "recipe_img": "[Image of Pizza Margherita]",
    "recipe_details": "Pizza Margherita is a timeless Italian favorite, celebrated for its simplicity and fresh ingredients. This pizza features a thin, crispy crust topped with a layer of rich tomato sauce, fresh mozzarella cheese, and vibrant basil leaves. The combination of these three ingredients not only creates a visually appealing dish with the colors of the Italian flag but also offers a delightful blend of flavors. The sweetness of the tomatoes, the creaminess of the mozzarella, and the aromatic basil make Pizza Margherita a perfect representation of Italian cuisine's elegance and taste.",
    "youtube_video_code": "https://www.youtube.com/watch?v=IUH4a_vIW34",
    "country": "Italy",
    "category": "Dinner",
    "creatorEmail": "nonna.pia@italianrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 7,
    "recipe_name": "Burrito Bowl",
    "recipe_img": "[Image of Burrito Bowl]",
    "recipe_details": "The Burrito Bowl is a popular Mexican-inspired dish that offers all the flavors of a burrito without the tortilla. It typically includes a base of seasoned rice and black beans, topped with your choice of protein such as grilled chicken, beef, or tofu. Fresh ingredients like lettuce, pico de gallo, corn, guacamole, and shredded cheese are then layered on top. The dish is finished with a drizzle of creamy dressing or salsa, making it a vibrant and satisfying meal. The Burrito Bowl is not only delicious but also customizable, allowing you to tailor it to your taste preferences.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Mexico",
    "category": "Lunch",
    "creatorEmail": "fresh.mexican.flavors@gmail.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 8,
    "recipe_name": "Stir-Fried Noodles with Vegetables",
    "recipe_img": "[Image of Stir-Fried Noodles with Vegetables]",
    "recipe_details": "Stir-Fried Noodles with Vegetables is a quick and easy dish that brings together the vibrant flavors of fresh vegetables and the savory taste of soy sauce-based stir-fry. Thin noodles are cooked until al dente and then tossed in a hot wok with a variety of vegetables like bell peppers, carrots, snap peas, and bok choy. Garlic, ginger, and soy sauce infuse the dish with a rich, aromatic flavor. Finished with a sprinkle of sesame seeds and fresh green onions, this dish is a healthy and delicious option for a light lunch or dinner.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "China",
    "category": "Lunch",
    "creatorEmail": "wok.wonders@asianfood.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 9,
    "recipe_name": "Shakshuka",
    "recipe_img": "[Image of Shakshuka]",
    "recipe_details": "Shakshuka is a hearty and flavorful dish that originated in North Africa and has become popular in the Middle East. It features eggs poached in a rich tomato sauce that is spiced with chili peppers, cumin, and paprika. The sauce is often enhanced with onions, bell peppers, and garlic, creating a savory base that perfectly complements the eggs. Shakshuka is traditionally served in the skillet it was cooked in, garnished with fresh herbs and sometimes feta cheese. It's a versatile dish that can be enjoyed for breakfast, lunch, or dinner, often with crusty bread to mop up the delicious sauce.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Morocco",
    "category": "Breakfast",
    "creatorEmail": "moroccan.flavors@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 10,
    "recipe_name": "Beef Stroganoff",
    "recipe_img": "[Image of Beef Stroganoff]",
    "recipe_details": "Beef Stroganoff is a classic Russian dish that combines tender strips of beef with a creamy, flavorful sauce. The beef is sautéed with onions and mushrooms, then simmered in a sauce made from beef broth, mustard, and sour cream. This rich and comforting dish is traditionally served over egg noodles or rice, making it a hearty meal that's perfect for cold weather. The combination of savory beef, tangy sour cream, and earthy mushrooms creates a delicious and satisfying flavor profile that has made Beef Stroganoff a favorite in many households around the world.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Russia",
    "category": "Dinner",
    "creatorEmail": "russian.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 11,
    "recipe_name": "Feijoada",
    "recipe_img": "[Image of Feijoada]",
    "recipe_details": "Feijoada is a traditional Brazilian stew made with black beans and a variety of salted pork or beef products. The dish is typically slow-cooked, allowing the flavors to meld together and create a rich, hearty meal. Common ingredients include sausages, pork ribs, and beef, which are simmered with black beans, onions, garlic, and bay leaves. Feijoada is often served with rice, collard greens, and orange slices, which help to balance the dish's richness. This beloved dish is a staple of Brazilian cuisine and is commonly enjoyed during family gatherings and celebrations.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Brazil",
    "category": "Dinner",
    "creatorEmail": "brazilian.cooking@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 12,
    "recipe_name": "Tom Yum Soup",
    "recipe_img": "[Image of Tom Yum Soup]",
    "recipe_details": "Tom Yum Soup is a hot and sour Thai soup that is known for its bold and complex flavors. The soup is typically made with a broth infused with lemongrass, kaffir lime leaves, galangal, and chilies. Shrimp, mushrooms, tomatoes, and onions are common additions, creating a hearty and flavorful soup. Fish sauce and lime juice are used to season the broth, giving it a perfect balance of salty, sour, and spicy notes. Garnished with fresh cilantro, Tom Yum Soup is a refreshing and invigorating dish that is enjoyed by many around the world.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Thailand",
    "category": "Appetizer",
    "creatorEmail": "thai.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 13,
    "recipe_name": "Croque Monsieur",
    "recipe_img": "[Image of Croque Monsieur]",
    "recipe_details": "Croque Monsieur is a classic French sandwich that is rich, cheesy, and utterly delicious. This sandwich features ham and Gruyère cheese layered between slices of buttered bread, which is then toasted until golden brown. The sandwich is topped with a creamy béchamel sauce and more cheese before being baked to perfection. The result is a crispy, gooey, and decadent treat that is perfect for breakfast or lunch. For an extra indulgent twist, you can add a fried egg on top to create a Croque Madame.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "France",
    "category": "Lunch",
    "creatorEmail": "french.flavors@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 14,
    "recipe_name": "Bibimbap",
    "recipe_img": "[Image of Bibimbap]",
    "recipe_details": "Bibimbap is a popular Korean dish that translates to 'mixed rice.' It consists of a bowl of warm white rice topped with a variety of sautéed and seasoned vegetables, sliced beef (usually bulgogi), a fried egg, and a dollop of gochujang (Korean chili paste). The ingredients are carefully arranged to create a visually appealing dish, and just before eating, everything is mixed together. The combination of flavors and textures—from the savory meat to the crisp vegetables and spicy-sweet gochujang—makes Bibimbap a delicious and satisfying meal.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "South Korea",
    "category": "Dinner",
    "creatorEmail": "korean.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 15,
    "recipe_name": "Butter Chicken",
    "recipe_img": "[Image of Butter Chicken]",
    "recipe_details": "Butter Chicken, also known as Murgh Makhani, is a popular Indian dish that features chicken in a creamy, buttery, and mildly spiced tomato sauce. The chicken is marinated in yogurt and spices, then cooked in a tandoor (traditional clay oven) before being simmered in a sauce made from tomatoes, butter, cream, and a blend of aromatic spices such as garam masala, cumin, and coriander. The result is a rich and flavorful dish that is best enjoyed with naan or basmati rice. Butter Chicken's creamy texture and balanced spices make it a favorite among many.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "India",
    "category": "Dinner",
    "creatorEmail": "indian.cuisine@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 16,
    "recipe_name": "Peking Duck",
    "recipe_img": "[Image of Peking Duck]",
    "recipe_details": "Peking Duck is a renowned Chinese dish known for its crispy skin and tender meat. The preparation of Peking Duck involves air-drying the duck for several hours and then roasting it until the skin is golden and crisp. The duck is often served with thin pancakes, hoisin sauce, and sliced green onions. To eat, a piece of crispy duck skin and meat is placed on a pancake, smeared with hoisin sauce, and topped with green onions before being rolled up and enjoyed. Peking Duck is a luxurious dish that has been a staple in Chinese cuisine for centuries.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "China",
    "category": "Dinner",
    "creatorEmail": "chinese.cuisine@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 17,
    "recipe_name": "Paella",
    "recipe_img": "[Image of Paella]",
    "recipe_details": "Paella is a traditional Spanish rice dish that originated in Valencia. It is known for its vibrant saffron-infused rice and a mix of seafood, chicken, rabbit, and vegetables. The dish is cooked in a wide, shallow pan over an open flame, allowing the rice to develop a crispy bottom layer known as socarrat. Key ingredients include bomba rice, saffron, chicken, rabbit, shellfish, green beans, and tomatoes. Paella is a communal dish that brings people together, often enjoyed during celebrations and family gatherings.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Spain",
    "category": "Dinner",
    "creatorEmail": "spanish.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 18,
    "recipe_name": "Bulgogi",
    "recipe_img": "[Image of Bulgogi]",
    "recipe_details": "Bulgogi is a Korean dish that features thinly sliced beef marinated in a mixture of soy sauce, sugar, sesame oil, garlic, and pepper, then grilled to perfection. The marinade gives the beef a sweet and savory flavor that is both tender and delicious. Bulgogi is often served with a side of lettuce leaves, rice, and various side dishes known as banchan. Diners can create their own wraps by placing a piece of grilled beef in a lettuce leaf, adding rice and banchan, and then wrapping it all up. This dish is a favorite for its rich flavors and interactive dining experience.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "South Korea",
    "category": "Dinner",
    "creatorEmail": "korean.flavors@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 19,
    "recipe_name": "Moussaka",
    "recipe_img": "[Image of Moussaka]",
    "recipe_details": "Moussaka is a traditional Greek casserole made with layers of eggplant, ground meat (usually lamb or beef), and a rich béchamel sauce. The eggplant is sliced and lightly fried, while the meat is cooked with onions, garlic, tomatoes, and a blend of spices including cinnamon and allspice. The ingredients are layered in a baking dish, topped with béchamel sauce, and baked until golden and bubbly. Moussaka is a comforting and hearty dish that showcases the robust flavors of Mediterranean cuisine, perfect for a family dinner or special occasion.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Greece",
    "category": "Dinner",
    "creatorEmail": "greek.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 20,
    "recipe_name": "Pho",
    "recipe_img": "[Image of Pho]",
    "recipe_details": "Pho is a traditional Vietnamese soup consisting of broth, rice noodles, herbs, and meat, usually beef (pho bò) or chicken (pho gà). The broth is made by simmering beef bones, ginger, and onions for several hours, creating a rich and flavorful base. The soup is served with thinly sliced raw beef or cooked chicken, which is placed over the noodles and topped with hot broth. Fresh herbs like basil, cilantro, and green onions, along with lime wedges, bean sprouts, and chili slices, are served on the side, allowing diners to customize their bowls. Pho is a beloved dish known for its aromatic and comforting qualities.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Vietnam",
    "category": "Dinner",
    "creatorEmail": "vietnamese.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 21,
    "recipe_name": "Coq au Vin",
    "recipe_img": "[Image of Coq au Vin]",
    "recipe_details": "Coq au Vin is a classic French dish that features chicken braised in red wine with mushrooms, onions, garlic, and lardons (small strips of pork or bacon). The dish is slow-cooked until the chicken is tender and infused with the rich flavors of the wine and aromatics. The sauce, made from the braising liquid, is thickened and served over the chicken, creating a deeply flavorful and comforting meal. Coq au Vin is traditionally served with crusty bread or potatoes, making it a perfect dish for a cozy dinner.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "France",
    "category": "Dinner",
    "creatorEmail": "french.cuisine@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 22,
    "recipe_name": "Tagine",
    "recipe_img": "[Image of Tagine]",
    "recipe_details": "Tagine is a traditional Moroccan stew named after the earthenware pot in which it is cooked. The dish typically includes a combination of meat (such as lamb, chicken, or beef), vegetables, dried fruits (like apricots or prunes), and a variety of spices, including cumin, coriander, turmeric, and cinnamon. The ingredients are slow-cooked together, allowing the flavors to meld and create a rich, aromatic sauce. Tagine is often served with couscous or bread, making it a hearty and flavorful meal that is perfect for sharing.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Morocco",
    "category": "Dinner",
    "creatorEmail": "moroccan.cuisine@culinaryadventures.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 23,
    "recipe_name": "Fish and Chips",
    "recipe_img": "[Image of Fish and Chips]",
    "recipe_details": "Fish and Chips is a classic British dish that consists of battered and fried fish served with thick-cut fries. The fish, usually cod or haddock, is coated in a light, crispy batter made from flour, baking powder, and beer or sparkling water. It is then deep-fried until golden and served with hot, crispy fries. Traditional accompaniments include malt vinegar, tartar sauce, and mushy peas. This dish is a beloved comfort food in the United Kingdom, often enjoyed at pubs and seaside eateries.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "United Kingdom",
    "category": "Dinner",
    "creatorEmail": "british.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 24,
    "recipe_name": "Goulash",
    "recipe_img": "[Image of Goulash]",
    "recipe_details": "Goulash is a hearty Hungarian stew that is known for its rich and robust flavors. The dish is made with chunks of beef, onions, tomatoes, bell peppers, and a generous amount of paprika, which gives it its distinctive red color and smoky flavor. The ingredients are simmered together until the meat is tender and the flavors are well blended. Goulash is traditionally served with a side of noodles, dumplings, or crusty bread, making it a satisfying and comforting meal that is perfect for cold weather.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Hungary",
    "category": "Dinner",
    "creatorEmail": "hungarian.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  },
  {
    "id": 25,
    "recipe_name": "Risotto",
    "recipe_img": "[Image of Risotto]",
    "recipe_details": "Risotto is a traditional Italian dish made from arborio rice cooked slowly in broth until it reaches a creamy consistency. The base of the dish is often a sofrito of onions and garlic, to which the rice is added and toasted. Gradual addition of warm broth, often accompanied by stirring, allows the rice to release its starch and create a creamy texture. Risotto can be flavored with a variety of ingredients, including mushrooms, seafood, saffron, or seasonal vegetables. Finished with a touch of butter and grated Parmesan cheese, risotto is a versatile and comforting dish that showcases the simplicity and elegance of Italian cuisine.",
    "youtube_video_code": "[invalid URL removed]",
    "country": "Italy",
    "category": "Dinner",
    "creatorEmail": "italian.cuisine@worldrecipes.com",
    "watchCount": 0,
    "purchased_by": []
  }
]
